{
  "entries": [
    {
      "id": "1756706507329",
      "title": "",
      "subtitle": "",
      "timestamp": "2025-09-01T08:30:00.000Z",
      "summary": "",
      "content": "Puoskari has no moral qualms about his recent actions. He believes in Fellowship's goals. People need more direction, the society needs involvement from the gods. To bring it about, he's ready to do many things. He thinks it's for the greater good. He's doing the dirty laundry the do-gooders can't do, and that's his job. If he needs to force Graele or some other good people out of the way, he's willing to do it, and won't feel guilty.\n\nThe possible bad reputation from the actions doesn't matter that much for Puoskari. He gets things done, whether it's Fellowship business or healing. If people need healing, he heals. He believes that by getting results, people will come to him for healing. People don't need to like him to get healing. Theose in need in healing can't be choosers."
    },
    {
      "id": "1756706507328",
      "title": "A Coffin Procured, a Dragon Defeated, and Darker Powers Revealed",
      "subtitle": "In which a coffin is bought, suspicions are raised, Sister Graele instructs, and a desperate struggle against Venomfang and his fell rider decides the fate of comrades upon the perilous road.",
      "timestamp": "2025-09-01T06:01:47.328Z",
      "summary": "The party secures a dwarf's coffin and mining tools, narrowly escapes suspicion when caught with arms and a corpse, and learns from Sister Graele of foul encephalon spawn. Their journey turns dire when Venomfang appears, bearing the Black Spider fused with Vecna's hand. A harrowing battle ensues: allies fall and rise again, ropes and courage topple foes, and in a desperate climax, the companions strike down both rider and dragon. In victory, they earn respite and renown, though greater darkness looms in the shadows beyond.",
      "content": "Hankimme arkun kääpiölle Barthans Provisionsista ja kaivosvälineitä Miner's Exchangelta. Palatessamme törmäsimme Gwyn Oresoniin ja Tomsdale ja Puoskari jäivät juttelemaan hänen kanssaan. Oreson ei osannut tarjota muuta tietoa kuin, etät Marturgrim the Valiant, Uljas, oli suuri sankari ja hänen muistiinpanojaan on syytä uskoa ja että obsidiaanin poalat voisi olla hyvä viedä hänen kotiinsa, missä ne olisivat turvassa.\n\nBippo's Pubissa edeltä menneet Gavrik ja Rosie jäivät kiinni Neveremberin sotilaille valtavan asemäärän kuljettamisesta bag of holdingissa. Koska joukolla on hyvä maine Phandalinissa, pääsimme juuri ja juuri pälkähästä, mutta kapteeni Eldbridge Gerry ei ollut vakuuttunut – varsinkaan, kun ottaa huomioon samassa pussisa viikoksi unohtuneet kääpiön ruumiin. Lopulta saimme aseista 75gp, joka on jokseenkin ryöstöhinta. Nundron ruumis palautettiin.\n\nTämän jälkeen kävimme Sister Graelen luona: kerroimme mihin olemme matkalla; kysyimme oudoista otuksista ja saimme selville, että kyseessä on encephalon gemmuleitai, jotka ovat immuuneja psychic damagelle ja resistantteja joillekin magiceille, ja joista kasvaa vielä ikävämpiä hirviöitä. Tämän jälkeen lähdimme matkaan kohti Talunderethia.\n\nSaavuttuamme tielle kohti Triboar Trailia, kuulimme kaukaisuudesta lohikäärmeen karjaisun. Emme kerenneet paeta tai piiloutua ennen kuin Venomfang lensi puurajan yli Black Spider selässään. Black Spiderin käden tilalla oli Vecnan käsi.\n\nTaistelun huippukohdat:<br>Venomfang lähes löi Tomsdalen, Puoskarin ja Gavrikin kanveesiin yhdellä breath attackillä<br>Gavrik taikoin Hasten ring of Spell Storingilla<br>Puoskari sai heittokoukulla ja köydellä pudotettau Black Spiderin Venomfangin selästä<br>Venomfang sai tajuttoman Tomsdalen hampaisiinsa ja oli tappamassa tätä, kun Puoskari paransi Tomsdalen ja Black Spider teleporttasi Tomsdalen sulkeutuvien hampaiden välistä<br>Tämän jälkeen pikavauhtia juokseva ja lyövä Gavrik löi Black Spiderin tajuttomaksi ja hyökkäsi Venomfangin kimppuun<br>Tomsdale sai Venomfangin kaatumaan ja lyömään päänsä, niin että Venomfang vaipui tajuttomaksi<br>Gavrik viimeisteli Venomnfangin Night Bladella, saaden taas kolme päivää aikaa, ja lyöden seutua piinanneen lohikäärmeen"
    },
    {
      "id": "1756706507328",
      "title": "Of Valor, Vengeance, and Ventures Unknown",
      "subtitle": "In which three adventurers, each burdened by duty, grief, and secrets, traverse the lands in search of justice, aid, and lost kin, their paths entwined by circumstance and the shadow of larger forces yet unseen.",
      "timestamp": "2025-09-01T06:01:47.328Z",
      "summary": "Rosie, a paladin with latent warlock power, seeks the support of the Lord’s Alliance for her home of Beroda. Gavrik, noble and steadfast, wields his sword with honor and purpose. Tomsdale, a halfling rogue haunted by family tragedy, pursues the remnants of kin lost to Xanathar’s wrath, driven by vengeance and the dark deeds of his uncle, the Black Spider. Together, the trio confront challenges that test courage, loyalty, and resolve, their fates intertwined by the hazards of their journey and the unseen machinations of greater powers looming over their world.",
      "content": "Other members of the party:\n\nRosie: A paladin from Beroda, who seems to have some warlock capabilities, even though if she doesn’t seem to pay a lot of attention to it. Is looking for Lord’s Alliances help in Beroda.\n\nGavrik: A noble warrior from Silverymoon. Serious, but noble. Great with sword.\n\nTomsdale: A halfling swashbuckler rogue, who’s looking for remaining members of his family, which was slaughtered by Xanathars because of his uncles - Black Spider - actions."
    },
    {
      "id": "1756706507328",
      "title": "Of Strange Maps, Vanished Boys, and Restless Spirits",
      "subtitle": "In which Puoskari and companions meet curious folk, pursue vanished children, uncover dreadful writings, and hear of obsidian relics and tentacled horrors.",
      "timestamp": "2025-09-01T06:01:47.328Z",
      "summary": "Puoskari breakfasted with Rosie, Gavrik, Tomsdale, and the enchanted child Vianola Lucan, before news of mind flayers, obsidian shards, and Phandalin’s strangeness was revealed by scholar Oreson. A missing boy led them to psychic foes in ruined halls, where Dumathoin’s paladin Marthungrim left a journal foretelling ghostly crypts, unsolved puzzles, and monstrous wounds. Returning to Phandalin, the weight of ancient secrets and Neverember’s summons hung heavily upon them.",
      "content": "Puoskari tapasi Rosien, Gavrikin ja Tomsdalen Red Onion majatalossa aamupalalla. Heidän mukanaan oli aikuisen miehen kehossa pieni tyttö nimeltä Vianola Lucan. Ser Gregorius Ironheartin kehoon oli jollain mystisellä taikuudella päätynyt jo toinen henkilö toisen vuorokauden sisään.\n\nEsittelyiden jälkeen, Gavrik ja Rosie veivät Vianola Lucan Sisar Graelen luokse hoitoon ja majoitukseen. Tomsdale ja Puoskari menivät juttelemaan Gwyn Oresonille, goblin-tutkijalle ja -historioitsijalle. Tomsdalen ja kumppaneiden löytämä kartta näytti kolmen paikan sijainnin Starmetal Hillsseillä: Talhundbereth, Crypt of Talhund ja Gibbet Crossing. Kaikki olivat muinaisia kääpiöiden paikkoja, jotka mind flayerit olivat vallanneet vuosisatoja sitten, mutta sittemmin hyljänneet. Näissä paikoissa ilmeisesti on kussakin obsidiaanin pala, jota Phandalinia häirinneet goblinit ovat etsineet. Ne liittyvät jotenkin Phandalinin kummalliseen tilaan.\n\nGwyn Oreson oli vahvasti sitä mieltä, että mind flayereiden ominaisuudet ja psyykkiset voimat selittäisivät sekä erikoiset goblinit ja Phandalinin kummalliset tapahtumat.\n\nRosie, Gavrik, Tomsdale ja Kevril saivat kirjeen raskaasti aseistetuilta Lord Neveremberin miehiltä. Kirjeen sisältö ei selvinnyt Puoskarille, mutta aiheutti syviä huokauksia seikkailijoissa.\n\nMatkalla Barthen’s Provisionsiin varusteostoksille kohtasimme itkevän naisen ja pienen selvityksen jälkeen selvisi, että hänen poikansa on kadonnut. Lähdimme etsimään tätä ja löysimme hänet rauniotalon laidalta, jonne hän oli seurannut hirviöitä. Peittosimme (jälleen psyykkisiä voimia omaavat) hirviöt.\n\nRaunio paljastui Dumathoinin paladinin taloksi. Löysimme päiväkirjan, jossa luki näin:\n\nMarthungrim was a paladin of Dumathoin who excavated this home more than 60 years ago. Dumathoin tasked Marthungrim with returning spirits to rest when a crypt for the god’s faithful was corrupted.\nMarthungrim learned that the crypt lies beneath a temple called Talhundereth, but the temple teemed with dangerous monsters. The crypt is protected by a lock with a puzzle that Dumathoin’s faithful could solve easier than others. (The puzzle’s answer isn’t included in the journal.)\nMarthungrim planned to destroy the restless ghosts that haunt the crypt so they could rest in peace.\nBadly wounded by a creature he described as “roiling heaps of tentacles,” Marthungrim returned here. His last entry describes his wounds getting worse.\n\nTämän jälkeen palasimme Phandaliniin."
    }
  ]
}
